#include <iostream>
using namespace std;

//void main()
//{
//	setlocale(LC_ALL, "");
//	cout << "ControlStructures" << endl;
//	/*if (condition)
//	{
//		...;
//		code1;
//		...;
//	}
//	else
//	{
//		...;
//		code2;
//		...;
//	}
//	///Condition - это условие (логическаое выражение).
//	///УСЛОВИЕ - СРАВНЕНИЕ
//	/// if - если
//	/// else - иначе, в противном случае;
//	/// if - управляющая структура которая выполняе т1 из 2 выриантов кода взамисимости от условия
//
//	/// Операторы сравнения всегда возвращают либо true, либо false (значения типа bool)
//	/// Усли уловие вернуло true, то выполняется код 1 и после его выполнения блок else и код2 игнорируются, если он есть.
//	/// Если же условие вернуло false, код1 игнорируетсяи выполнение сразу же переходит в блок else, если он есть
//	/// блок else и код2 являются не обязательными конструкции if
//	/// если условие вернуло true, то условный код будет выполнен в противном случае условынй код будет пропущен
//	if
//	{
//		.....;
//		conditional - code;
//		.....;
//	}*/
//	/*
//	 if (cond1)
//	{
//	   code_1;
//	}
//	else if (cond2)
//	{
//		code_2;
//	}
//	.....
//	.....
//	else if (cond_N)
//	{
//		code_N;
//	}
//	else
//	{
//		default_code;
//	}
//	*/
//	//Такая цепочка последовательно проверяет cond_1, cond_2, cond_N и если какое-то условие возвращает true, то выполняется соотвествующий ему код
//	// после выполнения соответсвующего кода происзодит выход за пределы всей цепочки
//	// если условие вернуло false то выполнится default_code, который находится в последнем else(если он есть)
//	// 
//	// Примечание - 1.условие всегда пишется в круглых скобках 2.После ключевого слова 'else' никогда не пишется условие
//	// Если после 'else' нежно написать условие, то сначало пишут 'if'
//	// потом условие
//	// else if (condition) - правильно
//	// 3.Ключевое слово else может быть написанно только после 'if()...';
//	/*
//	Цикл(Loop - петля) - это управляющая структура, которая позволяет многократно выполнить код(зациклить)
//	//В языке с++ есть 3 типа циклов
//	//1.While - цикл с пред условием.
//	//2.do while - цикл с пост условием.
//	//3.for - цикл на заданное число итераций;
//
//	Итерация это однократное выполнение тела цикла
//	Тело цикла - это код который нужно зациклить (многократно выполнить);
//	*/
//	/*int temperature;
//	cout << "Введите температуру воздуха: "; cin >> temperature;
//	cout << temperature << endl;
//
//	if (temperature > 70)
//	{
//		cout << "Вы на другой планете" << endl;
//	}
//	else if (temperature > 50)
//	{
//		cout << "Вы на экваторе" << endl;
//	}
//	else if (temperature > 30)
//	{
//		cout << "Очень жарко" << endl;
//	}
//	else if (temperature > 10)
//	{
//		cout << "Тепло" << endl;
//	}
//	else if (temperature > 0)
//	{
//		cout << "Прохладно" << endl;
//	}
//	else if (temperature > -10)
//	{
//		cout << "Мороз" << endl;
//	}
//	else if (temperature > -70)
//	{
//		cout << "Вы на северном полюсе" << endl;
//	}
//	else
//	{
//		cout << "Вы на другой планете" << endl;
//	}*/
//}